/*

Транзакція - послідовність одгого або декількох SQL запитів, які об'єднуються в одну логічну операцію

*/

/* Синтаксис транзакцій:

BEGIN; -- Початок транзакції

-- Ваші SQL запити тут (наприклад, вставка, оновлення, видалення даних)

COMMIT; -- Зберігаємо (фіксуємо) зміни


-- Якщо сталася помилка або щось пішло не так
ROLLBACK; -- Скасовуємо транзакцію та відміняємо зміни


-- Кінець транзакції


*/


BEGIN;

-- 1: створили замовлення
INSERT INTO orders(customer_id, status) VALUES
(6004, 'new')
RETURNING id;

-- 2: наповнити замовлення
INSERT INTO orders_to_products(order_id, products_id, quantity) VALUES
(LASTVAL(), 1, 1),
(LASTVAL(), 2, 3),
(LASTVAL(), 3, 1);

COMMIT;


ROLLBACK;